%macro unimacro 2
    MOV AX, %2
    CALL %1
%endmacro

;===[ Начало сегмента кода ]============================================
MYCODE: segment .code
org 100h ; Обязательная директива ТОЛЬКО для COM-файлов
START:
;---[ Точка старта ]-------------------------------------------------------------------—

    unimacro TASK3, 00h

;---[ Стандартное завершение программы - НЕ СТИРАТЬ НИКОГДА !!! ]----------------------—
    mov AX, 4C00h
    int 21h

TASK3:
    MOV SI, AX
    MOV CX, 15
  NEXT1:
    MOV BYTE[SI], '#'
    INC SI
    LOOP NEXT1
    
    MOV BYTE[SI], 00h
    

RET
;===[ Начало сегмента данных ]==========================================
