%macro unimacro 2
    MOV AX, %2
    CALL %1
%endmacro

;===[ Начало сегмента кода ]============================================
MYCODE: segment .code
org 100h ; Обязательная директива ТОЛЬКО для COM-файлов
START:
;---[ Точка старта ]-------------------------------------------------------------------—

    unimacro TASK2, 00h
    unimacro TASK2, 20h
    unimacro TASK2, 40h

;---[ Стандартное завершение программы - НЕ СТИРАТЬ НИКОГДА !!! ]----------------------—
    mov AX, 4C00h
    int 21h

TASK2:
    MOV SI, AX
    MOV AX, 00h
    MOV [SI], AX
RET
;===[ Начало сегмента данных ]==========================================
