%macro init2 3
	MOV dh, %1
	MOV dl, %2
	MOV bl, %3
	CALL TASK2
%endmacro


;===[ Начало сегмента кода ]============================================
MYCODE: segment .code
org 100h ; Обязательная директива ТОЛЬКО для COM-файлов
START:
;---[ Точка старта ]-------------------------------------------------------------------—

init2 5, 15, 00010010b

;---[ Стандартное завершение программы - НЕ СТИРАТЬ НИКОГДА !!! ]----------------------—
mov AX, 4C00h
int 21h

;---[ Начало подпрограммы ]-----------------------------------------------------------—


TASK2:
    mov ah,00h
    mov al, 3
    int 10h

    mov ah, 02h
    mov bh, 0
    int 10h

    mov ah, 13h
    mov al, 0
    mov cx, 15
    mov bp, top
    int 10h
    
    mov ah, 13h
    mov al, 0
    mov cx, 15
    inc dh
    mov bp, hello
    int 10h
    
    mov ah, 13h
    mov al, 0
    mov cx, 15
    inc dh
    mov bp, bottom
    int 10h
RET

;===[ Начало сегмента данных ]==========================================
top    db 201,205,205,205,205,205,205,205,205,205,205,205,205,205,187
hello  db 186,' Hello World ',186
bottom db 200,205,205,205,205,205,205,205,205,205,205,205,205,205,188

