%macro init2 3
	MOV dh, %1
	MOV dl, %2
	MOV bl, %3
	CALL TASK6
%endmacro


;===[ Начало сегмента кода ]============================================
MYCODE: segment .code
org 100h ; Обязательная директива ТОЛЬКО для COM-файлов
START:
;---[ Точка старта ]-------------------------------------------------------------------—

init2 5, 15, 00010010b

;---[ Стандартное завершение программы - НЕ СТИРАТЬ НИКОГДА !!! ]----------------------—
mov AX, 4C00h
int 21h

;---[ Начало подпрограммы ]-----------------------------------------------------------—


TASK6:
    mov ah,00h
    mov al, 3
    int 10h

    mov ah, 02h
    mov bh, 0
    int 10h

    mov ah, 13h
    mov al, 0
    mov cx, 16
    mov bp, str1
    int 10h
    
    mov ah, 13h
    mov al, 0
    mov cx, 16
    inc dh
    mov bp, str2
    int 10h

    mov ah, 13h
    mov al, 0
    mov cx, 16
    inc dh
    mov bp, str3
    int 10h

    mov ah, 13h
    mov al, 0
    mov cx, 16
    inc dh
    mov bp, str4
    int 10h

    mov ah, 13h
    mov al, 0
    mov cx, 16
    inc dh
    mov bp, str5
    int 10h
RET

;===[ Начало сегмента данных ]==========================================
str1 db 201,190,212,203,205,205,203,205,205,205,205,205,203,205,205,187
str2 db 199,205,32,206,205,32,204,205,32,204,205,205,204,205,32,185
str3 db 199,32,205,206,188,32,203,32,205,203,205,32,202,32,205,185
str4 db 199,205,32,203,205,32,202,205,205,206,205,205,206,205,32,185
str5 db 200,205,205,202,205,205,202,205,205,202,205,205,202,184,213,188